[
  {
    "id":1,
    "name":"Laptop",
    "category":"computers",
    "price":999.99,
    "stock":50,
    "description":"a portable, all-in-one personal computer with a hinged  design, featuring a built-in  offering similar functionality to a desktop for tasks like browsing, creating documents, and gaming.",
    "image":"public/laptop.webp"
  },
  {
    "id":2,
    "name":"smartphone",
    "category":"Mobiles",
    "price":499.99,
    "stock":100,
    "description":"Stay connected with a sleek and powerful smartphone built for speed and style. Enjoy a vivid display, high-quality camera, and reliable battery life for work, social media, gaming, and daily communication.",
    "image":"public/phone.jpg"
  },
  {
    "id":3,
    "name":"Wireless Headphones",
    "category":"Audio",
    "price":149.99,
    "stock":30,
    "description":"Experience immersive sound with these wireless headphones. Featuring noise isolation, deep bass, and a comfortable fit, they are perfect for music, calls, workouts, and long listening sessions without tangled wires.",
    "image":"public/wirelessheadphone.jpg"
  },
  {
    "id":4,
    "name":"Watches",
    "category":"Wearables",
    "price":199.99,
    "stock":20,
    "description":"A perfect blend of style and functionality, this watch complements both casual and formal looks. Designed with precision and durability, it helps you stay on time while enhancing your everyday fashion.",
    "image":"public/Watch.jpg"
  },
  {
    "id":5,
    "name":"Speaker",
     "price":599.99,
    "category":"Audio",
    "stock":30,
    "description":"Bring your music to life with this powerful speaker. Delivering clear audio and rich bass, it’s ideal for parties, outdoor gatherings, or home entertainment, with easy connectivity and portable design.",
    "image":"public/speaker.jpg"
  },
  {
    "id":6,
    "name":"Television",
    "category":"video",
    "price":199.99,
    "stock":20,
    "description":"Upgrade your viewing experience with this high-quality television. Enjoy sharp visuals, vibrant colors, and immersive sound, making movies, sports, and gaming more enjoyable from the comfort of your home.",
    "image":"public/television.jpg"
  }
  
]